{
  "posts": [
    {
      "id": "BLOG-001",
      "title": "Sistema de Saúde em Portugal: Guia Completo para Estrangeiros em 2025",
      "date": "2025-08-21T12:00:00.000Z",
      "image": "/images/uploads/1portugal.avif",
      "category": "saude",
      "summary": "Vem a Portugal em turismo, trabalho ou para estudar? Entenda como funciona o sistema de saúde em Portugal, os custos e os requisitos. Guia atualizado para 2025.",
      "body": "..."
    },
    {
      "id": "BLOG-002",
      "title": "Arrendar Casa em Portugal: Guia Essencial para 2025",
      "date": "2025-08-19T10:00:00.000Z",
      "image": "/images/uploads/2portugal.avif",
      "category": "habitacao",
      "summary": "Procurar casa para arrendar em Portugal pode ser um desafio, especialmente com a alta procura. Este guia simplifica o processo, desde a procura até à assinatura do contrato.",
      "body": "..."
    },
    {
      "id": "BLOG-003",
      "title": "Trabalhar em Portugal em 2025: O Guia Definitivo para Estrangeiros",
      "date": "2025-09-19T10:00:00.000Z",
      "image": "/images/uploads/11portugal.avif",
      "category": "emprego",
      "summary": "Sonha em trabalhar em Portugal? Descubra os vistos de trabalho, os setores com mais vagas e dicas para ter sucesso no mercado de trabalho português.",
      "body": "..."
    },
    {
      "id": "BLOG-004",
      "title": "Roteiro de 7 Dias por Portugal: Do Porto a Lisboa",
      "date": "2025-05-21T10:00:00.000Z",
      "image": "/images/uploads/10portugal.avif",
      "category": "turismo",
      "summary": "Explore o melhor de Portugal numa viagem inesquecível de uma semana. Descubra as cidades mais encantadoras, a gastronomia e as paisagens deslumbrantes.",
      "body": "..."
    },
    {
      "id": "BLOG-005",
      "title": "Estudar em Portugal: Guia para Estudantes Internacionais",
      "date": "2025-05-21T11:00:00.000Z",
      "image": "/images/uploads/6portugal.avif",
      "category": "educacao",
      "summary": "Saiba como funcionam as universidades em Portugal, os custos e o processo de candidatura. Prepare-se para uma experiência académica única na Europa.",
      "body": "..."
    },
    {
      "id": "BLOG-006",
      "title": "NIF em Portugal: O Que É e Como Obter o Seu",
      "date": "2025-08-22T10:00:00.000Z",
      "image": "/images/uploads/7portugal.avif",
      "category": "emprego",
      "summary": "O Número de Identificação Fiscal (NIF) é essencial para viver, trabalhar ou investir em Portugal. Saiba o que é, para que serve e como pode obter o seu de forma simples.",
      "body": "..."
    },
    {
      "id": "BLOG-007",
      "title": "Viver em Portugal: Custo de Vida em 2025",
      "date": "2025-07-15T10:00:00.000Z",
      "image": "/images/uploads/8portugal.avif",
      "category": "habitacao",
      "summary": "Portugal é conhecido pelo seu custo de vida acessível. Analisamos os principais custos, desde o alojamento à alimentação, para que possa planear o seu orçamento.",
      "body": "..."
    },
    {
      "id": "BLOG-008",
      "title": "Golden Visa Portugal: O Guia Completo para Investidores",
      "date": "2025-06-10T10:00:00.000Z",
      "image": "/images/uploads/9portugal.avif",
      "category": "turismo",
      "summary": "O programa Golden Visa tem sido uma porta de entrada para investidores que procuram residência na Europa. Conheça os requisitos, benefícios e as alterações recentes.",
      "body": "..."
    },
    {
      "id": "BLOG-009",
      "title": "Praias de Portugal: As 5 Melhores para Visitar no Verão",
      "date": "2025-05-30T10:00:00.000Z",
      "image": "/images/uploads/3portugal.avif",
      "category": "turismo",
      "summary": "De areais extensos a pequenas enseadas escondidas, a costa portuguesa é um paraíso. Descubra as praias que não pode perder na sua próxima viagem.",
      "body": "..."
    },
    {
      "id": "BLOG-010",
      "title": "Reagrupamento Familiar em Portugal: Como Trazer a Sua Família",
      "date": "2025-04-20T10:00:00.000Z",
      "image": "/images/uploads/blog_2025_08_19.webp",
      "category": "habitacao",
      "summary": "Se já reside legalmente em Portugal, saiba que pode ter o direito de trazer os seus familiares. Explicamos os passos e documentos necessários para o processo.",
      "body": "..."
    }
  ]
}